### Pandas

In [167]:
import pandas as pd

In [168]:
# Series : datatype in pandas

s1=pd.Series([10,20,30,40])

In [169]:
print(s1)

0    10
1    20
2    30
3    40
dtype: int64

In [170]:
s1=pd.Series([10,20,30,40],index=['a','b','c','d'])

In [171]:
print(s1)

a    10
b    20
c    30
d    40
dtype: int64

In [172]:
s2=pd.Series([10,20,30,40],index=['a','b','c','d'],name='Age')
print(s2)

a    10
b    20
c    30
d    40
Name: Age, dtype: int64

In [173]:
dic1={'a':10,'b':20,'c':30}

s3=pd.Series(dic1)

In [174]:
print(s3)

a    10
b    20
c    30
dtype: int64

In [175]:
s3=pd.Series(dic1,name='Age')
print(s3)

a    10
b    20
c    30
Name: Age, dtype: int64

In [176]:
import numpy as np

In [177]:
np_array=np.array([1,2,3,4,4,5])

In [178]:
s6=pd.Series(np_array)
print(s6)

0    1
1    2
2    3
3    4
4    4
5    5
dtype: int64

In [179]:
s6=pd.Series(np_array,index=['a','b','c','d','e','f'],name='id')
print(s6)

a    1
b    2
c    3
d    4
e    4
f    5
Name: id, dtype: int64

In [180]:
s6['c']

np.int64(3)

In [181]:
print(s6.values[3])

4

In [182]:
mylist=[1,2,3,4,5]

In [183]:
list_S=pd.Series(mylist)
print(list_S)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [184]:
list_S=pd.Series(mylist,index=['a','b','c','d','e'])
print(list_S)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [185]:
list_S=pd.Series(mylist,index=['a','b','c','d'])
print(list_S)

ValueError: Length of values (5) does not match length of index (4)

In [ ]:
list_S=pd.Series(mylist,index=['a','b','c','d','e','f'])
print(list_S)

In [ ]:
list_S=pd.Series(mylist,index=['a','b','c','d','e'],name='num')
print(list_S)

In [ ]:
mydict={1:'Irwin',2:'Tanya',3:'Nandu'}
print(mydict)

In [ ]:
dict_S=pd.Series(mydict)
print(dict_S)

In [ ]:
dict_S=pd.Series(mydict,index=['a','b','c'],name='test')
print(dict_S)

In [ ]:
mylist

In [ ]:
list_array=np.array(mylist)
print(list_array)

In [ ]:
array_S=pd.Series(list_array)
print(array_S)

In [ ]:
array_S=pd.Series(list_array,index=['a','b','c','d','e'])
print(array_S)

In [ ]:
array_S=pd.Series(list_array,index=['a','b','c','d','e'],name='Array')
print(array_S)

In [ ]:
print(array_S.index)

In [ ]:
print(array_S.values)

In [ ]:
print(array_S.dtype)

In [ ]:
print(array_S.name)

In [ ]:
print(array_S.shape)

### Slicing & Dicing

In [ ]:
dic1={'a':10,'b':20,'c':30}

s3=pd.Series(dic1)

In [ ]:
print(s3)

In [ ]:
print(s3.values[0])

In [ ]:
print(s3.values[2])

In [ ]:
print(s3.loc['b'])

In [ ]:
print(s3.iloc[1])

In [ ]:
print(s3.iloc[2])

In [ ]:
print(s3.loc[['b','a']])

In [ ]:
print(s3.iloc[1:])

In [ ]:
dic1={1:'Irwin',2:'Tanya',3:'Abhay'}

s3=pd.Series(dic1)

In [ ]:
print(s3)

In [ ]:
s3.loc[1:]

In [ ]:
s3.loc[1:3] #inclusive

In [ ]:
s3.iloc[1:3] #exclusive, works on positional indexing

### Data Frames

In [186]:
# create dicttionary

mydict={
        'fName':['Irwin','Tanya','Nandita'],
        'lName':['Chawla','Chawla','Sinha'],
        'Age':[35,33,58]
}

print(mydict)

{'fName': ['Irwin', 'Tanya', 'Nandita'], 'lName': ['Chawla', 'Chawla', 'Sinha'], 'Age': [35, 33, 58]}

In [187]:
df=pd.DataFrame(mydict)
print(df)

     fName   lName  Age
0    Irwin  Chawla   35
1    Tanya  Chawla   33
2  Nandita   Sinha   58

In [188]:
data=[
        {'fName': 'Irwin','lName':'Chawla','Age':35},
        {'fName': 'Tanya','lName':'Chawla','Age':33},
        {'fName': 'Nandita','lName':'Sinha','Age':58}

]

In [189]:
df1=pd.DataFrame(data)

In [190]:
print(df1)

     fName   lName  Age
0    Irwin  Chawla   35
1    Tanya  Chawla   33
2  Nandita   Sinha   58

In [191]:
df1['fName']

0      Irwin
1      Tanya
2    Nandita
Name: fName, dtype: object

In [192]:
df

     fName   lName  Age
0    Irwin  Chawla   35
1    Tanya  Chawla   33
2  Nandita   Sinha   58

In [193]:
df['fName']

0      Irwin
1      Tanya
2    Nandita
Name: fName, dtype: object

In [194]:
df[['fName','lName']]

     fName   lName
0    Irwin  Chawla
1    Tanya  Chawla
2  Nandita   Sinha

In [195]:
df.loc[0:1]

   fName   lName  Age
0  Irwin  Chawla   35
1  Tanya  Chawla   33

In [196]:
df.iloc[0:2]

   fName   lName  Age
0  Irwin  Chawla   35
1  Tanya  Chawla   33

In [197]:
type(df)

pandas.core.frame.DataFrame

In [273]:

# https://github.com/datasciencedojo/datasets
titanic_dataset_github_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

# https://github.com/mwaskom/seaborn-data/tree/master

iris_dataset_github_url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/refs/heads/master/iris.csv"

# kaggle
kaggle_link = "https://www.kaggle.com/datasets/yasserh/titanic-dataset/data"

In [199]:
df=pd.read_csv(titanic_dataset_github_url)

In [200]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [201]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [202]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [203]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [204]:
df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [205]:
df[['Name','Age','Survived']]

                                                  Name   Age  Survived
0                              Braund, Mr. Owen Harris  22.0         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                             Allen, Mr. William Henry  35.0         0
..                                                 ...   ...       ...
886                              Montvila, Rev. Juozas  27.0         0
887                       Graham, Miss. Margaret Edith  19.0         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN         0
889                              Behr, Mr. Karl Howell  26.0         1
890                                Dooley, Mr. Patrick  32.0         0

[891 rows x 3 columns]

In [206]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [207]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [208]:
df.loc[0:1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [209]:
df.iloc[0:1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [210]:
df.iloc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [211]:
df.loc[0,['Name','Age']]

Name    Braund, Mr. Owen Harris
Age                        22.0
Name: 0, dtype: object

In [212]:
df.loc[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [213]:
df.iloc[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [214]:
df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [ ]:
## Conditional selection

In [215]:
df['Age']>70.0

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [216]:
df[df['Age']>70.0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [217]:
df[df['Age'] > 70.0][['Name','Age']]

                                     Name   Age
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0

In [218]:
df[(df['Sex']=='female') & (df['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [219]:
df[(df['Sex']=='female') & (df['Survived']==1)]['Name']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
                             ...
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: Name, Length: 233, dtype: object

In [220]:
ShortData=df[(df['Sex']=='female') & (df['Survived']==1)][['Name','Age']]

In [221]:
ShortData

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [222]:
ShortData.head(2)

                                                Name   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0

In [224]:
# get number of people survived


print(len(df[df['Survived']==1]))

342

In [225]:
mylist=[1,2,3,4]

In [226]:
print(mylist)

[1, 2, 3, 4]

In [229]:
df_S=pd.Series(mylist,index=['a','b','c','d'],name='id')
print(df_S)

a    1
b    2
c    3
d    4
Name: id, dtype: int64

In [231]:
mydict={
    'id':1,
    'Name':'Irwin',
    'Age' : 35
}

In [236]:
df_S=pd.Series(mydict)
print(df_S)

id          1
Name    Irwin
Age        35
dtype: object

In [242]:
print(df_S.index)
print(df_S.values)
print(df_S.dtype)
print(df_S.name)
print(df_S.shape)

Index(['id', 'Name', 'Age'], dtype='object')
[1 'Irwin' 35]
object
None
(3,)

In [244]:
myarray=np.array(mylist)
print(myarray)

[1 2 3 4]

In [245]:
df_S=pd.Series(myarray)
print(df_S)

0    1
1    2
2    3
3    4
dtype: int64

In [246]:
df_S

0    1
1    2
2    3
3    4
dtype: int64

In [249]:
df_S.loc[0:2]

0    1
1    2
2    3
dtype: int64

In [250]:
df_S.iloc[0:2]

0    1
1    2
dtype: int64

In [251]:
mydict={
    'Name':['Irwin','Tanya','Nandita'],
    'Age':[35,33,58],
    'Sex':['M','F','F']
}

In [254]:
df_1=pd.DataFrame(mydict)
df_1

      Name  Age Sex
0    Irwin   35   M
1    Tanya   33   F
2  Nandita   58   F

In [256]:
mylist2=[
    {'Name':'Irwin',
     'Age':35,
     'Sex':'M'
    },
    {'Name':'Tanya',
     'Age':33,
     'Sex':'F'
    },
    {'Name':'Nandita',
     'Age':58,
     'Sex':'F'
    }
]

In [257]:
mylist2

[{'Name': 'Irwin', 'Age': 35, 'Sex': 'M'},
 {'Name': 'Tanya', 'Age': 33, 'Sex': 'F'},
 {'Name': 'Nandita', 'Age': 58, 'Sex': 'F'}]

In [259]:
df_list=pd.DataFrame(mylist2)

In [261]:
df_list

      Name  Age Sex
0    Irwin   35   M
1    Tanya   33   F
2  Nandita   58   F

In [262]:
myarray=[[1,2],[3,4]]
df_array=pd.DataFrame(myarray)
print(df_array)

   0  1
0  1  2
1  3  4

In [263]:
df_list

      Name  Age Sex
0    Irwin   35   M
1    Tanya   33   F
2  Nandita   58   F

In [268]:
df_list.loc[0:2]

      Name  Age Sex
0    Irwin   35   M
1    Tanya   33   F
2  Nandita   58   F

In [269]:
df_list.iloc[0:2]

    Name  Age Sex
0  Irwin   35   M
1  Tanya   33   F

In [271]:
df_list[['Name','Age']]

      Name  Age
0    Irwin   35
1    Tanya   33
2  Nandita   58

In [275]:
data=pd.read_csv(titanic_dataset_github_url)

In [276]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [278]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [279]:
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [280]:
data.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [291]:
data.loc[0,'Name']

'Braund, Mr. Owen Harris'

In [289]:
data.loc[0,['Name','Age']]

Name    Braund, Mr. Owen Harris
Age                        22.0
Name: 0, dtype: object

In [294]:
data.iloc[0,5]

np.float64(22.0)

In [296]:
data[data['Age']>70.0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [297]:
data[data['Age']>70.0]['Name']

96                Goldschmidt, Mr. George B
116                    Connors, Mr. Patrick
493                 Artagaveytia, Mr. Ramon
630    Barkworth, Mr. Algernon Henry Wilson
851                     Svensson, Mr. Johan
Name: Name, dtype: object

In [298]:
data[data['Age']>70.0][['Name','Age']]

                                     Name   Age
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0

In [303]:
data[(data['Sex']=='female') & (data['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [304]:
data[(data['Sex']=='female') & (data['Survived']==1)][['Name','Age']]

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [305]:
Total_Survived=len(data[data['Survived']==1])

In [310]:
data[data['Survived']==1]['Age'].count()

np.int64(290)

In [308]:
len(data[data['Survived']==1]['Age'])

342

In [311]:
data[data['Survived']==1]['Age'].nunique()

65